vmux0.0.10-pre/ycsbVMs_ycsb_2vms_vmux-emu_-1rps_rep1/vm2.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6380 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6380 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-08-21 16:56:44:588 0 sec: 0 operations; est completion in 0 second 
2024-08-21 16:56:54:449 10 sec: 18956 operations; 1895.6 current ops/sec; est completion in 2 days 14 hours [READ: Count=9645, Max=46047, Min=200, Avg=515.16, 90=593, 99=714, 99.9=3701, 99.99=10671] [UPDATE: Count=9316, Max=8831, Min=201, Avg=511.07, 90=591, 99=723, 99.9=4419, 99.99=7215] 
2024-08-21 16:57:04:449 20 sec: 39275 operations; 2031.9 current ops/sec; est completion in 2 days 12 hours [READ: Count=10119, Max=3001, Min=197, Avg=491.21, 90=585, 99=639, 99.9=718, 99.99=2711] [UPDATE: Count=10195, Max=2837, Min=196, Avg=485.14, 90=580, 99=637, 99.9=712, 99.99=2717] 
2024-08-21 16:57:14:450 30 sec: 60919 operations; 2164.4 current ops/sec; est completion in 2 days 10 hours [READ: Count=10824, Max=2539, Min=195, Avg=461.05, 90=565, 99=621, 99.9=663, 99.99=2483] [UPDATE: Count=10820, Max=7947, Min=196, Avg=456.95, 90=559, 99=614, 99.9=684, 99.99=2567] 
2024-08-21 16:57:24:449 40 sec: 84186 operations; 2326.7 current ops/sec; est completion in 2 days 8 hours [READ: Count=11621, Max=8815, Min=194, Avg=432.7, 90=546, 99=611, 99.9=712, 99.99=2603] [UPDATE: Count=11646, Max=4343, Min=194, Avg=423.09, 90=539, 99=607, 99.9=761, 99.99=2739] 
2024-08-21 16:57:34:449 50 sec: 106901 operations; 2271.5 current ops/sec; est completion in 2 days 7 hours [READ: Count=11406, Max=2611, Min=188, Avg=443.13, 90=545, 99=610, 99.9=705, 99.99=2519] [UPDATE: Count=11309, Max=7455, Min=185, Avg=432.63, 90=539, 99=600, 99.9=700, 99.99=2707] 
2024-08-21 16:57:44:449 60 sec: 127861 operations; 2096 current ops/sec; est completion in 2 days 7 hours [READ: Count=10351, Max=4823, Min=186, Avg=478.89, 90=575, 99=616, 99.9=721, 99.99=2879] [UPDATE: Count=10609, Max=2739, Min=189, Avg=471.7, 90=570, 99=611, 99.9=691, 99.99=2687] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-08-21 16:57:45:461 61 sec: 129895 operations; 2011.87 current ops/sec; est completion in 2 days 8 hours [READ: Count=1007, Max=4119, Min=203, Avg=498.95, 90=567, 99=624, 99.9=875, 99.99=4119] [CLEANUP: Count=1, Max=931, Min=931, Avg=931, 90=931, 99=931, 99.9=931, 99.99=931] [UPDATE: Count=1027, Max=2699, Min=207, Avg=490.55, 90=562, 99=609, 99.9=855, 99.99=2699] 
[OVERALL], RunTime(ms), 61018
[OVERALL], Throughput(ops/sec), 2128.798059588974
[TOTAL_GCS_Copy], Count, 12
[TOTAL_GC_TIME_Copy], Time(ms), 16
[TOTAL_GC_TIME_%_Copy], Time(%), 0.026221770625061456
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.026221770625061456
[READ], Operations, 64973
[READ], AverageLatency(us), 468.9912271251135
[READ], MinLatency(us), 186
[READ], MaxLatency(us), 46047
[READ], 95thPercentileLatency(us), 592
[READ], 99thPercentileLatency(us), 630
[READ], Return=OK, 64973
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 931.0
[CLEANUP], MinLatency(us), 931
[CLEANUP], MaxLatency(us), 931
[CLEANUP], 95thPercentileLatency(us), 931
[CLEANUP], 99thPercentileLatency(us), 931
[UPDATE], Operations, 64922
[UPDATE], AverageLatency(us), 461.7741443578448
[UPDATE], MinLatency(us), 185
[UPDATE], MaxLatency(us), 8831
[UPDATE], 95thPercentileLatency(us), 588
[UPDATE], 99thPercentileLatency(us), 627
[UPDATE], Return=OK, 64922
AUTOTEST_DONE